<template>
  <div class="reaction-table">
    <reaction-module-title placeholder="表格" name="table"></reaction-module-title>
    <div class="container">
      <div class="thead">
        <div class="wrapper" :style="`width:${width}`" v-for="(item, index) in table.thead" :key="index">
          <div contenteditable="true">
            {{ item }}
          </div>
          <img src="/imgs/用户主页/删除项目.svg">
        </div>
        <img src="/imgs/用户主页/添加项目.svg" v-show="this.table.thead.length <= 10">
      </div>
      <div class="tbody" v-for="(row, i) in table.tbody" :key="i">
        <div class="wrapper" :style="`width:${width}`" v-for="(item, j) in row" :key="j">
          <div contenteditable="true">{{ item }}</div>
        </div>
        <img src="/imgs/左边栏/删除成员.svg">
      </div>
      <div class="NewRow" contenteditable="false">+</div>
    </div>
  </div>
</template>

<script>
import ReactionModuleTitle from '../basic/ReactionModuleTitle.vue'
export default {
  name: 'ReactionTable',
  components:
    { ReactionModuleTitle },
  data() {
    return {
      width: '210px',
      // table: {
      //   thead: ['名称', '分子量', '质量', '产率', '备注', '名称', '分子量', '质量', '产率', '备注'],
      //   tbody: [['苯甲酸', '191.3g/mol', '13g', '25%', '无', '苯甲酸', '191.3g/mol', '13g', '25%', '无'], ['大幅拉升房间看哈上课的话费卡上飞机后打开撒谎疯狂的还是分开啊截断复活卡都是分开后的撒开发数据库的饭卡收到后尽快发哈就开始大幅加快和思考大幅拉升房间看哈上课的话费卡上飞机后打开撒谎疯狂的还是分开啊截断复活卡都是分开后的撒开发数据库的饭卡收到后尽快发哈就开始大幅加快和思考大幅拉升房间看哈上课的话费卡上飞机后打开撒谎疯狂的还是分开啊截断复活卡都是分开后的撒开发数据库的饭卡收到后尽快发哈就开始大幅加快和思考大幅拉升房间看哈上课的话费卡上飞机后打开撒谎疯狂的还是分开啊截断复活卡都是分开后的撒开发数据库的饭卡收到后尽快发哈就开始大幅加快和思考', '大幅拉升房间看哈上课的话费卡上飞机后打开撒谎疯狂的还是分开啊截断复活卡都是分开后的撒开发数据库的饭卡收到后尽快发哈就开始大幅加快和思考大幅拉升房间看哈上课的话费卡上飞机后打开撒谎疯狂的还是分开啊截断复活卡都是分开后的撒开发数据库的饭卡收到后尽快发哈就开始大幅加快和思考大幅拉升房间看哈上课的话费卡上飞机后打开撒谎疯狂的还是分开啊截断复活卡都是分开后的撒开发数据库的饭卡收到后尽快发哈就开始大幅加快和思考大幅拉升房间看哈上课的话费卡上飞机后打开撒谎疯狂的还是分开啊截断复活卡都是分开后的撒开发数据库的饭卡收到后尽快发哈就开始大幅加快和思考', '大幅拉升房间看哈上课的话费卡上飞机后打开撒谎疯狂的还是分开啊截断复活卡都是分开后的撒开发数据库的饭卡收到后尽快发哈就开始大幅加快和思考大幅拉升房间看哈上课的话费卡上飞机后打开撒谎疯狂的还是分开啊截断复活卡都是分开后的撒开发数据库的饭卡收到后尽快发哈就开始大幅加快和思考大幅拉升房间看哈上课的话费卡上飞机后打开撒谎疯狂的还是分开啊截断复活卡都是分开后的撒开发数据库的饭卡收到后尽快发哈就开始大幅加快和思考大幅拉升房间看哈上课的话费卡上飞机后打开撒谎疯狂的还是分开啊截断复活卡都是分开后的撒开发数据库的饭卡收到后尽快发哈就开始大幅加快和思考', '大幅拉升房间看哈上课的话费卡上飞机后打开撒谎疯狂的还是分开啊截断复活卡都是分开后的撒开发数据库的饭卡收到后尽快发哈就开始大幅加快和思考大幅拉升房间看哈上课的话费卡上飞机后打开撒谎疯狂的还是分开啊截断复活卡都是分开后的撒开发数据库的饭卡收到后尽快发哈就开始大幅加快和思考大幅拉升房间看哈上课的话费卡上飞机后打开撒谎疯狂的还是分开啊截断复活卡都是分开后的撒开发数据库的饭卡收到后尽快发哈就开始大幅加快和思考大幅拉升房间看哈上课的话费卡上飞机后打开撒谎疯狂的还是分开啊截断复活卡都是分开后的撒开发数据库的饭卡收到后尽快发哈就开始大幅加快和思考', '大幅拉升房间看哈上课的话费卡上飞机后打开撒谎疯狂的还是分开啊截断复活卡都是分开后的撒开发数据库的饭卡收到后尽快发哈就开始大幅加快和思考大幅拉升房间看哈上课的话费卡上飞机后打开撒谎疯狂的还是分开啊截断复活卡都是分开后的撒开发数据库的饭卡收到后尽快发哈就开始大幅加快和思考大幅拉升房间看哈上课的话费卡上飞机后打开撒谎疯狂的还是分开啊截断复活卡都是分开后的撒开发数据库的饭卡收到后尽快发哈就开始大幅加快和思考大幅拉升房间看哈上课的话费卡上飞机后打开撒谎疯狂的还是分开啊截断复活卡都是分开后的撒开发数据库的饭卡收到后尽快发哈就开始大幅加快和思考', '大幅拉升房间看哈上课的话费卡上飞机后打开撒谎疯狂的还是分开啊截断复活卡都是分开后的撒开发数据库的饭卡收到后尽快发哈就开始大幅加快和思考大幅拉升房间看哈上课的话费卡上飞机后打开撒谎疯狂的还是分开啊截断复活卡都是分开后的撒开发数据库的饭卡收到后尽快发哈就开始大幅加快和思考大幅拉升房间看哈上课的话费卡上飞机后打开撒谎疯狂的还是分开啊截断复活卡都是分开后的撒开发数据库的饭卡收到后尽快发哈就开始大幅加快和思考大幅拉升房间看哈上课的话费卡上飞机后打开撒谎疯狂的还是分开啊截断复活卡都是分开后的撒开发数据库的饭卡收到后尽快发哈就开始大幅加快和思考', '大幅拉升房间看哈上课的话费卡上飞机后打开撒谎疯狂的还是分开啊截断复活卡都是分开后的撒开发数据库的饭卡收到后尽快发哈就开始大幅加快和思考大幅拉升房间看哈上课的话费卡上飞机后打开撒谎疯狂的还是分开啊截断复活卡都是分开后的撒开发数据库的饭卡收到后尽快发哈就开始大幅加快和思考大幅拉升房间看哈上课的话费卡上飞机后打开撒谎疯狂的还是分开啊截断复活卡都是分开后的撒开发数据库的饭卡收到后尽快发哈就开始大幅加快和思考大幅拉升房间看哈上课的话费卡上飞机后打开撒谎疯狂的还是分开啊截断复活卡都是分开后的撒开发数据库的饭卡收到后尽快发哈就开始大幅加快和思考', '大幅拉升房间看哈上课的话费卡上飞机后打开撒谎疯狂的还是分开啊截断复活卡都是分开后的撒开发数据库的饭卡收到后尽快发哈就开始大幅加快和思考大幅拉升房间看哈上课的话费卡上飞机后打开撒谎疯狂的还是分开啊截断复活卡都是分开后的撒开发数据库的饭卡收到后尽快发哈就开始大幅加快和思考大幅拉升房间看哈上课的话费卡上飞机后打开撒谎疯狂的还是分开啊截断复活卡都是分开后的撒开发数据库的饭卡收到后尽快发哈就开始大幅加快和思考大幅拉升房间看哈上课的话费卡上飞机后打开撒谎疯狂的还是分开啊截断复活卡都是分开后的撒开发数据库的饭卡收到后尽快发哈就开始大幅加快和思考', '大幅拉升房间看哈上课的话费卡上飞机后打开撒谎疯狂的还是分开啊截断复活卡都是分开后的撒开发数据库的饭卡收到后尽快发哈就开始大幅加快和思考大幅拉升房间看哈上课的话费卡上飞机后打开撒谎疯狂的还是分开啊截断复活卡都是分开后的撒开发数据库的饭卡收到后尽快发哈就开始大幅加快和思考大幅拉升房间看哈上课的话费卡上飞机后打开撒谎疯狂的还是分开啊截断复活卡都是分开后的撒开发数据库的饭卡收到后尽快发哈就开始大幅加快和思考大幅拉升房间看哈上课的话费卡上飞机后打开撒谎疯狂的还是分开啊截断复活卡都是分开后的撒开发数据库的饭卡收到后尽快发哈就开始大幅加快和思考', '大幅拉升房间看哈上课的话费卡上飞机后打开撒谎疯狂的还是分开啊截断复活卡都是分开后的撒开发数据库的饭卡收到后尽快发哈就开始大幅加快和思考大幅拉升房间看哈上课的话费卡上飞机后打开撒谎疯狂的还是分开啊截断复活卡都是分开后的撒开发数据库的饭卡收到后尽快发哈就开始大幅加快和思考大幅拉升房间看哈上课的话费卡上飞机后打开撒谎疯狂的还是分开啊截断复活卡都是分开后的撒开发数据库的饭卡收到后尽快发哈就开始大幅加快和思考大幅拉升房间看哈上课的话费卡上飞机后打开撒谎疯狂的还是分开啊截断复活卡都是分开后的撒开发数据库的饭卡收到后尽快发哈就开始大幅加快和思考']]
      // }
      table: {
        thead: ['名称', '分子量', '质量', '产率', '备注'],
        tbody: [['苯甲酸', '191.3g/mol', '13g', '25%', '无']]
      }
    }
  },
  watch: {
    table: {
      handler(oldValue, newValue) {
        this.width = 1200 / newValue.thead.length + 'px'
      },
      deep: true
    }
  }
}
</script>
<style lang="scss">
.reaction-table {
  .container {
    box-sizing: border-box;
    font-size: 16px;
    user-select: text;
    width: 1200px;
    border-radius: 5px;
    border: 1px solid #000000;
    padding: 10px;

    .thead,
    .tbody {
      text-align: left;
      display: flex;
      justify-content: space-between;
      margin-bottom: 10px;
      align-items: center;

      .wrapper {

        margin-right: 10px;

        border: 1px solid #FFFFFF;

        div {
          padding: 2px;
          width: 100%;
        }
      }

      img {
        cursor: pointer;
        width: 20px;
        height: 20px;
        opacity: 0;
      }
    }

    .thead:hover,
    .tbody:hover {
      .wrapper {
        border: 1px solid #D7D7D7;
      }

      img {
        opacity: 100%;
      }
    }

    .thead {
      font-weight: bold;

      .wrapper {

        position: relative;

        &:hover img {
          transition: opacity 1s;
          opacity: 100%;
        }

        img {
          opacity: 0;
          width: 16px;
          height: 16px;
          position: absolute;
          top: 4px;
          right: 5px;
        }
      }
    }

    .NewRow {
      border-radius: 5px;
      border: 1px dashed #000000;
      height: 24px;
      line-height: 24px;
      width: 1180px;
      cursor: pointer;
      text-align: center;
    }
  }
}
</style>
